// The four adjacent digits in the 1000-digit number that have the greatest product are 9 × 9 × 8 × 9 = 5832.
// Find the thirteen adjacent digits in the 1000-digit number that have the greatest product. What is the value of this product?

#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#define MAX 100000

int main(){
    char str[1100];
    int num=0, c=0;
    long long int ans1=1, ans2=1;

    // 入力を文字列として読み込む
    printf("入力してください。\n");
    while(c<1000){
        scanf("%c", &str[c]);
        c++;
    }

    // 読み込んだ文字列を表示
    // for(int i=0; i<20; i++){
    //     for(int j=0; j<51; j++){ 
    //         printf("%c", str[i][j]);
    //     }
    // }
    
    c=0;
    while(c<988){                   // 先頭から数えてc文字目
        printf("%d文字目：", c); 
        for(int i=0; i<13; i++){    // 13個の数字を取り出す
            char p;
            char *samp;
            p=str[i+c];             // 1文字ずつ取り出す
            samp = &p;              // 取り出したもののアドレスをsampに代入
            num = atoi(samp);       // sampのアドレスの中身をint型に変換
            printf("%d,", num);
            ans1*=num;              // 取りだした数字を掛け合わせる
        }
        printf(":%lld\n", ans1);    // 13個の数字の積を表示
        if(ans1>ans2) ans2=ans1;
        else ans2=ans2;
        ans1=1;
        c++;                            // 1行読み込んだら、次の行を読み込む
    }
    printf("The largest product is %lld\n", ans2);
}


// input data
//7316717653133062491922511967442657474235534919493496983520312774506326239578318016984801869478851843858615607891129494954595017379583319528532088055111254069874715852386305071569329096329522744304355766896648950445244523161731856403098711121722383113622298934233803081353362766142828064444866452387493035890729629049156044077239071381051585930796086670172427121883998797908792274921901699720888093776657273330010533678812202354218097512545405947522435258490771167055601360483958644670632441572215539753697817977846174064955149290862569321978468622482839722413756570560574902614079729686524145351004748216637048440319989000889524345065854122758866688116427171479924442928230863465674813919123162824586178664583591245665294765456828489128831426076900422421902267105562632111110937054421750694165896040807198403850962455444362981230987879927244284909188845801561660979191338754992005240636899125607176060588611646710940507754100225698315520005593572972571636269561882670428252483600823257530420752963450